<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Microsoft Teams installer and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.rtrouton.munki.microsoftteams</string>
    <key>ParentRecipe</key>
    <string>com.github.rtrouton.pkg.microsoftteams</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MicrosoftTeams</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/Microsoft</string>
        <key>VENDOR</key>
         <string>Microsoft</string>
         <key>SOFTWARETITLE</key>
         <string>Teams</string>
         <key>VERSIONTYPE</key>
         <string>CFBundleShortVersionString</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>Production</string>
            </array>
            <key>description</key>
            <string>Microsoft Teams</string>
            <key>display_name</key>
            <string>Microsoft Teams</string>
            <key>developer</key>
            <string>Microsoft</string>
            <key>category</key>
            <string>Productivity</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>minimum_os_version</key>
            <string>10.10.0</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>2.7</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>additional_makepkginfo_options</key>
                <array>
                    <string>--pkgvers</string>
                    <string>%version%</string>
                </array>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_ids_set_optional_true</key>
                <array>
                    <string>com.microsoft.MSTeamsAudioDevice</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>MunkiOptionalReceiptEditor</string>
        </dict>
    </array>
</dict>
</plist>
